11. 데이터 분석을 위한 패키지

2) 구조적 데이터 표시와 처리에 강한 pandas

구조적 데이터 생성하기

Series를 활용한 데이터 생성

In [4]:
import pandas as pd

In [5]:
# s = pd.Series(seq_data)
s1 = pd.Series([10, 20, 30, 40, 50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
s1.index
print(s1.index)

RangeIndex(start=0, stop=5, step=1)

In [7]:
s1.values

array([10, 20, 30, 40, 50], dtype=int64)

In [8]:
s2 = pd.Series(['a', 'b', 'c', 1, 2, 3])
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [11]:
s2.values.dtype

dtype('O')

In [12]:
import numpy as np

s3 = pd.Series([np.nan, 10, 30])
s3

0     NaN
1    10.0
2    30.0
dtype: float64

In [15]:
# s = pd.Series(seq_data, index = index_seq)
index_date = ['2018-10-07', '2018-10-08', '2018-10-09', '2018-10-10']
s4 = pd.Series([200, 195, np.nan, 205], index = index_date)
s4

2018-10-07    200.0
2018-10-08    195.0
2018-10-09      NaN
2018-10-10    205.0
dtype: float64

In [17]:
# s = pd.Series(dict_data)
# key값이 인덱스로, value가 value로
s5 = pd.Series({'국어': 100, '영어': 85, '수학': 90})
s5

국어    100
영어     85
수학     90
dtype: int64

날짜 자동 생성: data_range

In [19]:
# pd.date_range(start = None, end = None, periods = None, freq = 'D')
# 모두 default parameter 를 갖고 있다. end와 epriods는 배타적 관계. 둘 중 1개만 씀
pd.date_range(start = '2019-01-01', end = '2019-01-07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [20]:
pd.date_range(start = '2019.01.01', end = '2019/01/07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [21]:
# 날짜 데이터의 형식 yyyy-mm-dd, yyyy.mm.dd, yyyy/mm/dd, mm-dd-yyyy, mm.dd.yyyy, mm/dd/yyyy
# 하지만 생성된 날짜 데이터는 모두 yyyy-mm-dd
pd.date_range(start = '01-01-2019', end = '01.07.2019')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [22]:
pd.date_range(start = '2019-01-01', periods = 7)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [24]:
pd.date_range(start = '2019-01-01', periods = 4, freq = '2D') # 이틀

DatetimeIndex(['2019-01-01', '2019-01-03', '2019-01-05', '2019-01-07'], dtype='datetime64[ns]', freq='2D')

In [26]:
pd.date_range(start = '2019-01-01', periods = 4, freq = 'W') # 일주일

DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27'], dtype='datetime64[ns]', freq='W-SUN')

In [ ]:
pd.date_range(start = '2019-01-01', periods = 4, freq = 'W')

In [27]:
pd.date_range(start = '2019-01-01', periods = 12, freq = '2BM') # 2개월 주기 업무 월말 날자 기준

DatetimeIndex(['2019-01-31', '2019-03-29', '2019-05-31', '2019-07-31',
               '2019-09-30', '2019-11-29', '2020-01-31', '2020-03-31',
               '2020-05-29', '2020-07-31', '2020-09-30', '2020-11-30'],
              dtype='datetime64[ns]', freq='2BM')

In [28]:
pd.date_range(start = '2019-01-01', periods = 4, freq = 'QS') # 분기 시작 날짜 기준

DatetimeIndex(['2019-01-01', '2019-04-01', '2019-07-01', '2019-10-01'], dtype='datetime64[ns]', freq='QS-JAN')

In [30]:
date_lst = ['2020-06-20', '2020-06-21', '2020-06-22', '2020-06-23', '2020-06-23']
dt = pd.to_datetime(date_lst)
pd.Series([51, 62, 55, 48, 58], index = dt)

2020-06-20    51
2020-06-21    62
2020-06-22    55
2020-06-23    48
2020-06-23    58
dtype: int64

DataFrame을 활용한 데이터 생성

In [31]:
# df = pd.DataFrame(data [, index = index_data, columns = columns_data])
# 행 단위로 만들어짐. 하지만 df는 열단위로 읽기 때문에 데이터를 읽는 데 문제가 생길 수 있다.
pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [33]:
data_list = np.array([[10, 20, 30], [40, 50, 60], [70, 80, 90]])
pd.DataFrame(data_list)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [35]:
data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]])
index_date = pd.date_range(start='2020-01-01', periods=4)
columns_list = ['A', 'B', 'C']
pd.DataFrame(data, index = index_date, columns = columns_list)

             A   B   C
2020-01-01   1   2   3
2020-01-02   4   5   6
2020-01-03   7   8   9
2020-01-04  10  11  12

In [38]:
table_data = {'연도': [2015, 2016, 2017, 2018, 2019],
             '지사': ['한국', '미국', '영국', '일본', '중국'],
             '고객 수': [500, 200, 300, 100, 100]}
table_data

{'연도': [2015, 2016, 2017, 2018, 2019],
 '지사': ['한국', '미국', '영국', '일본', '중국'],
 '고객 수': [500, 200, 300, 100, 100]}

In [39]:
pd.DataFrame(table_data)

     연도  지사  고객 수
0  2015  한국   500
1  2016  미국   200
2  2017  영국   300
3  2018  일본   100
4  2019  중국   100

In [43]:
df = pd.DataFrame(table_data, columns = ['연도', '지사', '고객 수'])
df

     연도  지사  고객 수
0  2015  한국   500
1  2016  미국   200
2  2017  영국   300
3  2018  일본   100
4  2019  중국   100

In [44]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [45]:
df.values

array([[2015, '한국', 500],
       [2016, '미국', 200],
       [2017, '영국', 300],
       [2018, '일본', 100],
       [2019, '중국', 100]], dtype=object)

In [46]:
df.columns

Index(['연도', '지사', '고객 수'], dtype='object')

데이터 연산

In [51]:
aaa = pd.Series(['a', 'b', 'c', '1', '2', '3'])
aaa

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [64]:
df = pd.DataFrame()
df['A'] = [1, 2, 3]
df['B'] = [4, 5, 6]
df['C'] = pd.Series([7, 8, 9])

print(df, '\n')
print(df.dtypes, '\n')
print(df['A'].dtype, '\n')
print(type(df['A']), '\n'))

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

A    int64
B    int64
C    int64
dtype: object

int64

<class 'pandas.core.series.Series'>

In [65]:
arr = np.array([[10, 20, 30], [40, 50, 60], [70, 80, 90]])
arr = arr.transpose() # 전치행렬
df = pd.DataFrame(arr)
df

    0   1   2
0  10  40  70
1  20  50  80
2  30  60  90

데이터 연산

In [66]:
s1 = pd.Series([10, 20, 30, 40, 50])
s2 = pd.Series([6, 7, 8, 9, 10])
s1 + s2

0    16
1    27
2    38
3    49
4    60
dtype: int64

In [68]:
s1 - s2

0     4
1    13
2    22
3    31
4    40
dtype: int64

In [69]:
s1 * s2

0     60
1    140
2    240
3    360
4    500
dtype: int64

In [70]:
s1 / s2

0    1.666667
1    2.857143
2    3.750000
3    4.444444
4    5.000000
dtype: float64

In [71]:
# pandas의 데이터끼리는 서로 크기가 달라도 연산할 수 있음.
s3 = pd.Series([1, 2, 3, 4])
s4 = pd.Series([10, 20, 30, 40, 50])

# 연산을 할 수 있는 항목만 연산 수행
s3 + s4

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [72]:
s4 - s3

0     9.0
1    18.0
2    27.0
3    36.0
4     NaN
dtype: float64

In [73]:
s3 * s4

0     10.0
1     40.0
2     90.0
3    160.0
4      NaN
dtype: float64

In [74]:
s3 / s4

0    0.1
1    0.1
2    0.1
3    0.1
4    NaN
dtype: float64

In [79]:
table_data1 = {'A': [1, 2, 3, 4, 5],
             'B': [10, 20, 30, 40, 50],
             'C': [100, 200, 300, 400, 500]}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [80]:
table_data2 = {'A': [6, 7, 8],
             'B': [60, 70, 80],
             'C': [600, 700, 800]}
df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [81]:
df1 + df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN